FlatBuffers.FlatBufferBuilder
Responsible for building up and accessing a FlatBuffer formatted byte
array (via ByteBuffer).

FlatBuffers.FlatBufferBuilder.#ctor(System.Int32)
Create a FlatBufferBuilder with a given initial size.
initialSize:
The initial size to use for the internal buffer.

FlatBuffers.FlatBufferBuilder.Clear
Reset the FlatBufferBuilder by purging all data that it holds.

FlatBuffers.FlatBufferBuilder.ForceDefaults
Gets and sets a Boolean to disable the optimization when serializing
default values to a Table.
In order to save space, fields that are set to their default value
don't get serialized into the buffer.

FlatBuffers.FlatBufferBuilder.Offset
@cond FLATBUFFERS_INTERNAL

FlatBuffers.FlatBufferBuilder.AddBool(System.Boolean)
Add a `bool` to the buffer (aligns the data and grows if necessary).
x: The `bool` to add to the buffer.

FlatBuffers.FlatBufferBuilder.AddSbyte(System.SByte)
Add a `sbyte` to the buffer (aligns the data and grows if necessary).
x: The `sbyte` to add to the buffer.

FlatBuffers.FlatBufferBuilder.AddByte(System.Byte)
Add a `byte` to the buffer (aligns the data and grows if necessary).
x: The `byte` to add to the buffer.

FlatBuffers.FlatBufferBuilder.AddShort(System.Int16)
Add a `short` to the buffer (aligns the data and grows if necessary).
x: The `short` to add to the buffer.

FlatBuffers.FlatBufferBuilder.AddUshort(System.UInt16)
Add an `ushort` to the buffer (aligns the data and grows if necessary).
x: The `ushort` to add to the buffer.

FlatBuffers.FlatBufferBuilder.AddInt(System.Int32)
Add an `int` to the buffer (aligns the data and grows if necessary).
x: The `int` to add to the buffer.

FlatBuffers.FlatBufferBuilder.AddUint(System.UInt32)
Add an `uint` to the buffer (aligns the data and grows if necessary).
x: The `uint` to add to the buffer.

FlatBuffers.FlatBufferBuilder.AddLong(System.Int64)
Add a `long` to the buffer (aligns the data and grows if necessary).
x: The `long` to add to the buffer.

FlatBuffers.FlatBufferBuilder.AddUlong(System.UInt64)
Add an `ulong` to the buffer (aligns the data and grows if necessary).
x: The `ulong` to add to the buffer.

FlatBuffers.FlatBufferBuilder.AddFloat(System.Single)
Add a `float` to the buffer (aligns the data and grows if necessary).
x: The `float` to add to the buffer.

FlatBuffers.FlatBufferBuilder.AddDouble(System.Double)
Add a `double` to the buffer (aligns the data and grows if necessary).
x: The `double` to add to the buffer.

FlatBuffers.FlatBufferBuilder.AddOffset(System.Int32)
Adds an offset, relative to where it will be written.
off: The offset to add to the buffer.

FlatBuffers.FlatBufferBuilder.StartVector(System.Int32,System.Int32,System.Int32)
FLATBUFFERS_INTERNAL

FlatBuffers.FlatBufferBuilder.EndVector
Writes data necessary to finish a vector construction.

FlatBuffers.FlatBufferBuilder.CreateVectorOfTables``1(FlatBuffers.Offset{``0}[])
Creates a vector of tables.
offsets: Offsets of the tables.

FlatBuffers.FlatBufferBuilder.Nested(System.Int32)
cond FLATBUFFERS_INTENRAL

FlatBuffers.FlatBufferBuilder.AddBool(System.Int32,System.Boolean,System.Boolean)
Adds a Boolean to the Table at index `o` in its vtable using the value `x` and default `d`
o: The index into the vtable
x: The value to put into the buffer. If the value is equal to the default
and FlatBuffers.FlatBufferBuilder.ForceDefaults is false, the value will be skipped.
d: The default value to compare the value against

FlatBuffers.FlatBufferBuilder.AddSbyte(System.Int32,System.SByte,System.SByte)
Adds a SByte to the Table at index `o` in its vtable using the value `x` and default `d`
o: The index into the vtable
x: The value to put into the buffer. If the value is equal to the default
and FlatBuffers.FlatBufferBuilder.ForceDefaults is false, the value will be skipped.
d: The default value to compare the value against

FlatBuffers.FlatBufferBuilder.AddByte(System.Int32,System.Byte,System.Byte)
Adds a Byte to the Table at index `o` in its vtable using the value `x` and default `d`
o: The index into the vtable
x: The value to put into the buffer. If the value is equal to the default
and FlatBuffers.FlatBufferBuilder.ForceDefaults is false, the value will be skipped.
d: The default value to compare the value against

FlatBuffers.FlatBufferBuilder.AddShort(System.Int32,System.Int16,System.Int32)
Adds a Int16 to the Table at index `o` in its vtable using the value `x` and default `d`
o: The index into the vtable
x: The value to put into the buffer. If the value is equal to the default
and FlatBuffers.FlatBufferBuilder.ForceDefaults is false, the value will be skipped.
d: The default value to compare the value against

FlatBuffers.FlatBufferBuilder.AddUshort(System.Int32,System.UInt16,System.UInt16)
Adds a UInt16 to the Table at index `o` in its vtable using the value `x` and default `d`
o: The index into the vtable
x: The value to put into the buffer. If the value is equal to the default
and FlatBuffers.FlatBufferBuilder.ForceDefaults is false, the value will be skipped.
d: The default value to compare the value against

FlatBuffers.FlatBufferBuilder.AddInt(System.Int32,System.Int32,System.Int32)
Adds an Int32 to the Table at index `o` in its vtable using the value `x` and default `d`
o: The index into the vtable
x: The value to put into the buffer. If the value is equal to the default
and FlatBuffers.FlatBufferBuilder.ForceDefaults is false, the value will be skipped.
d: The default value to compare the value against

FlatBuffers.FlatBufferBuilder.AddUint(System.Int32,System.UInt32,System.UInt32)
Adds a UInt32 to the Table at index `o` in its vtable using the value `x` and default `d`
o: The index into the vtable
x: The value to put into the buffer. If the value is equal to the default
and FlatBuffers.FlatBufferBuilder.ForceDefaults is false, the value will be skipped.
d: The default value to compare the value against

FlatBuffers.FlatBufferBuilder.AddLong(System.Int32,System.Int64,System.Int64)
Adds an Int64 to the Table at index `o` in its vtable using the value `x` and default `d`
o: The index into the vtable
x: The value to put into the buffer. If the value is equal to the default
and FlatBuffers.FlatBufferBuilder.ForceDefaults is false, the value will be skipped.
d: The default value to compare the value against

FlatBuffers.FlatBufferBuilder.AddUlong(System.Int32,System.UInt64,System.UInt64)
Adds a UInt64 to the Table at index `o` in its vtable using the value `x` and default `d`
o: The index into the vtable
x: The value to put into the buffer. If the value is equal to the default
and FlatBuffers.FlatBufferBuilder.ForceDefaults is false, the value will be skipped.
d: The default value to compare the value against

FlatBuffers.FlatBufferBuilder.AddFloat(System.Int32,System.Single,System.Double)
Adds a Single to the Table at index `o` in its vtable using the value `x` and default `d`
o: The index into the vtable
x: The value to put into the buffer. If the value is equal to the default
and FlatBuffers.FlatBufferBuilder.ForceDefaults is false, the value will be skipped.
d: The default value to compare the value against

FlatBuffers.FlatBufferBuilder.AddDouble(System.Int32,System.Double,System.Double)
Adds a Double to the Table at index `o` in its vtable using the value `x` and default `d`
o: The index into the vtable
x: The value to put into the buffer. If the value is equal to the default
and FlatBuffers.FlatBufferBuilder.ForceDefaults is false, the value will be skipped.
d: The default value to compare the value against

FlatBuffers.FlatBufferBuilder.AddOffset(System.Int32,System.Int32,System.Int32)
Adds a buffer offset to the Table at index `o` in its vtable using the value `x` and default `d`
o: The index into the vtable
x: The value to put into the buffer. If the value is equal to the default
and FlatBuffers.FlatBufferBuilder.ForceDefaults is false, the value will be skipped.
d: The default value to compare the value against

FlatBuffers.FlatBufferBuilder.CreateString(System.String)
Encode the string `s` in the buffer using UTF-8.
s: The string to encode.
Returns:
The offset in the buffer where the encoded string starts.

FlatBuffers.FlatBufferBuilder.AddStruct(System.Int32,System.Int32,System.Int32)
@cond FLATBUFFERS_INTERNAL

FlatBuffers.FlatBufferBuilder.Finish(System.Int32)
Finalize a buffer, pointing to the given `root_table`.
rootTable:
An offset to be added to the buffer.

FlatBuffers.FlatBufferBuilder.DataBuffer
Get the ByteBuffer representing the FlatBuffer.
Remarks:
This is typically only called after you call `Finish()`.
The actual data starts at the ByteBuffer's current position,
not necessarily at `0`.
Returns:
Returns the ByteBuffer for this FlatBuffer.

FlatBuffers.FlatBufferBuilder.SizedByteArray
A utility function to copy and return the ByteBuffer data as a
`byte[]`.
Returns:
A full copy of the FlatBuffer data.

FlatBuffers.FlatBufferBuilder.Finish(System.Int32,System.String)
Finalize a buffer, pointing to the given `rootTable`.
rootTable:
An offset to be added to the buffer.
fileIdentifier:
A FlatBuffer file identifier to be added to the buffer before
`root_table`.